from telethon import events

def register_menu(client, state, GLOBAL_GROUPS, save_state, send_status):
    def is_owner(e):
        return e.sender_id == state["owner_id"]

    MENU_TEXT = """
╔════════════════════╗
      🎛  منوی اصلی ربات  
╚════════════════════╝

👤 ┇ مدیریت کاربران
 ━━━━━━━━━━━━━━
 • .ثبت / .حذف
 • .ثبت کپی
 • .لیست
 • .کپی
 • .کپی خاموش
 • .کپی پلاس

⚙️ ┇ مدیریت ربات
 ━━━━━━━━━━━━━━
 • .ریست دیتا
 • .عدد
 • .تنظیم [متن]
 • .ست 😀 💮 ⚡️
 • .ست حذف همه

🎮 ┇ بازی‌ها
 ━━━━━━━━━━━━━━
 • .حدس عدد
 • .سنگ کاغذ قیچی
 • .تاس
 • .تاس [عدد]
 • .شانس
 • .معما

🎭 ┇ سرگرمی
 ━━━━━━━━━━━━━━
 • .میم
 • .واقعیت
 • .انگیزه
 • .دیالوگ
 • .بزن (ریپلای)
 • .بغل (ریپلای)
 • .بپرس [سوال]
 • .اسم
 • .جوک

✨ ┇ سرگرمی پلاس
 ━━━━━━━━━━━━━━
 • .سرگرمی فان
 • .تست شخصیت
 • .معمای سخت

🛡 ┇ مدیریت گروه
 ━━━━━━━━━━━━━━
 • .سکوت
 • .حذف سکوت
 • .تنظیم خوشامد [متن]
 • .خوشامدگویی

🔐 ┇ امنیت
 ━━━━━━━━━━━━━━
 • .خروج همه
 • .قفل [بخش]
 • .باز [بخش]

📖 ┇ توضیحات
 ━━━━━━━━━━━━━━
 • .توضیح [بخش]
 • .توضیح [دستور]

╔════════════════════╗
   🌐 فقط صاحب ربات قابل استفاده  
╚════════════════════╝
    """

    @client.on(events.NewMessage(pattern=r"\.منو$"))
    async def menu(event):
        if not is_owner(event): return
        sent = await client.send_message("me", MENU_TEXT)
        state["menu_msg_id"] = sent.id
        save_state()
        await event.delete()